app/Http/Controllers/PracticeController.php

    public function index()
    {
        $practices = Practice::oldest()
            ->with('vets')
            ->with('noScopeResults')
            ->with('admin')
            ->paginate(9);
---
select * from `practices` order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `practices`