app/Models/File.php

select * from `files` where `name` = 'gooddata.csv' limit 1
---
    private function existsInStorage($fileName)
    {
        return Storage::exists("labresults/{$fileName}") ? true : false;