app/Models/LabResult.php

select * from `lab_results` where `practice_id` = '1' order by `id` asc
---
    public function fetchAll()
    {
        return $this->with('vet')->with('practice')->oldest('id')->get();

update `lab_results` set `vet_comment` = 'xavi', `vet_indicator` = 'xavivivi', `vet_id` = '33', `status` = 'PROCESSED', `updated_at` = '2018-10-17 17:46:10' where `id` = '295' and `practice_id` = '1'
---
    public function process()
    {
        $this->whereId($this->id)
             ->update([
                'vet_comment'   => request('vet_comment'),
                'vet_indicator' => request('vet_indicator'),
                'vet_id'        => auth()->id(),
                'status'        => LabResult::PROCESSED
            ]);