app/Providers/AppServiceProvider.php

    public function boot()
    {
        // Passing $farmers variable to layouts.nav view.

        \View::composer('layouts.nav', function ($view) {
            if (auth()->check()) {
            $view->with('farmers',
                \App\LabResult::where('practice_id', auth()->user()->practice_id)
                                ->select('farmer_name')
                                ->distinct()
                                ->get());
            }
        });
---
select distinct `farmer_name` from `lab_results` where `practice_id` = '1' order by `farmer_name` asc